var data = [
{name:'文理地铁站', value:10},
{name:'NTU EEE', value:8},
{name:'崇文中学', value:1},
{name:'维多利亚学校', value:1},
{name:'德行小学', value:1},
{name:'Charis Montessori幼儿园', value:1},
{name:'NTU NIE', value:1},
{name:'大巴窖巴士转换站', value:183},
{name:'碧山转换站', value:35},
{name:'淡滨尼巴士转换站', value:44},
{name:'文礼巴士转换站', value:145},
{name:'金文泰巴士转换站', value:48},
{name:'Bugis Junction白沙浮商业城', value:295},
{name:'樟宜综合医院', value:58},
];



var geoCoordMap = {
'文理地铁站':[103.7058277,1.3385559],
'NTU EEE':[103.6807396,1.3426962],
'崇文中学':[103.8419271,1.3783368],
'维多利亚学校':[103.9266378,1.3084027],
'德行小学':[103.7076403,1.3514322],
'Charis Montessori幼儿园':[103.8762078,1.3679886],
'NTU NIE':[103.6788074,1.3488647],
'大巴窖巴士转换站':[103.8474252,1.3323297],
'碧山转换站':[103.8481737,1.3508449],
'淡滨尼巴士转换站':[103.9451538,1.3533834],
'文礼巴士转换站':[103.70546,1.339323],
'金文泰巴士转换站':[103.763691,1.3147484],
'Bugis Junction白沙浮商业城':[103.8555261,1.2993754],
'樟宜综合医院':[103.9495701,1.3401915]
};
